# DataFrame i Series

In [374]:
import pandas as pd

In [375]:
pd.read_excel("xl/course_participants.xlsx")

   numer   imię  wiek    kraj  ocena kontynent
0   1001   Mark    55  Włochy    4.5    Europa
1   1000   John    33     USA    6.7   Ameryka
2   1002    Tim    41     USA    3.9   Ameryka
3   1003  Jenny    12  Niemcy    9.0    Europa

In [376]:
data=[["Mark", 55, "Włochy", 4.5, "Europa"],
      ["John", 33, "USA", 6.7, "Ameryka"],
      ["Tim", 41, "USA", 3.9, "Ameryka"],
      ["Jenny", 12, "Niemcy", 9.0, "Europa"]]

df = pd.DataFrame(data=data,
                  columns=["imię", "wiek", "kraj",
                           "ocena", "kontynent"],
                  index=[1001, 1000, 1002, 1003])
df

       imię  wiek    kraj  ocena kontynent
1001   Mark    55  Włochy    4.5    Europa
1000   John    33     USA    6.7   Ameryka
1002    Tim    41     USA    3.9   Ameryka
1003  Jenny    12  Niemcy    9.0    Europa

In [377]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4 entries, 1001 to 1003
Data columns (total 5 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   imię       4 non-null      object
 1   wiek       4 non-null      int64
 2   kraj       4 non-null      object
 3   ocena      4 non-null      float64
 4   kontynent  4 non-null      object
dtypes: float64(1), int64(1), object(3)
memory usage: 192.0+ bytes

In [378]:
df.dtypes

imię          object
wiek           int64
kraj          object
ocena        float64
kontynent     object
dtype: object

In [379]:
dict = {
    "names": ["Arnold", "Czarek", "Ronald", "Max"],
    "age": [5, 7, 3, 6]
}

dogs = pd.DataFrame(dict)
dogs

    names  age
0  Arnold    5
1  Czarek    7
2  Ronald    3
3     Max    6

## Indeks

In [380]:
df.index

Int64Index([1001, 1000, 1002, 1003], dtype='int64')

In [381]:
df.index.name = "numer"
df

        imię  wiek    kraj  ocena kontynent
numer
1001    Mark    55  Włochy    4.5    Europa
1000    John    33     USA    6.7   Ameryka
1002     Tim    41     USA    3.9   Ameryka
1003   Jenny    12  Niemcy    9.0    Europa

In [382]:
# Metoda "reset_index" przekształca indeks w kolumnę, zastępując
# indeks indeksem domyślnym. Odpowiada to pierwszemu DataFrame,
# który wczytaliśmy z Excela.
df.reset_index()

   numer   imię  wiek    kraj  ocena kontynent
0   1001   Mark    55  Włochy    4.5    Europa
1   1000   John    33     USA    6.7   Ameryka
2   1002    Tim    41     USA    3.9   Ameryka
3   1003  Jenny    12  Niemcy    9.0    Europa

In [383]:
# Metoda "reset_index" zmienia "numer" w zwykłą kolumnę,
# a "set_index" zmienia kolumnę "imię" w indeks.
df.reset_index().set_index("imię")

       numer  wiek    kraj  ocena kontynent
imię
Mark    1001    55  Włochy    4.5    Europa
John    1000    33     USA    6.7   Ameryka
Tim     1002    41     USA    3.9   Ameryka
Jenny   1003    12  Niemcy    9.0    Europa

In [384]:
df

        imię  wiek    kraj  ocena kontynent
numer
1001    Mark    55  Włochy    4.5    Europa
1000    John    33     USA    6.7   Ameryka
1002     Tim    41     USA    3.9   Ameryka
1003   Jenny    12  Niemcy    9.0    Europa

In [385]:
df.reindex([999, 1000, 1001, 1004])

       imię  wiek    kraj  ocena kontynent
numer
999     NaN   NaN     NaN    NaN       NaN
1000   John  33.0     USA    6.7   Ameryka
1001   Mark  55.0  Włochy    4.5    Europa
1004    NaN   NaN     NaN    NaN       NaN

In [386]:
df.sort_index()

        imię  wiek    kraj  ocena kontynent
numer
1000    John    33     USA    6.7   Ameryka
1001    Mark    55  Włochy    4.5    Europa
1002     Tim    41     USA    3.9   Ameryka
1003   Jenny    12  Niemcy    9.0    Europa

In [387]:
df.sort_values(["kontynent", "wiek"])

        imię  wiek    kraj  ocena kontynent
numer
1000    John    33     USA    6.7   Ameryka
1002     Tim    41     USA    3.9   Ameryka
1003   Jenny    12  Niemcy    9.0    Europa
1001    Mark    55  Włochy    4.5    Europa

## Kolumny

In [388]:
df.columns

Index(['imię', 'wiek', 'kraj', 'ocena', 'kontynent'], dtype='object')

In [389]:
df.columns.name = "cechy"
df

cechy   imię  wiek    kraj  ocena kontynent
numer
1001    Mark    55  Włochy    4.5    Europa
1000    John    33     USA    6.7   Ameryka
1002     Tim    41     USA    3.9   Ameryka
1003   Jenny    12  Niemcy    9.0    Europa

In [390]:
df.rename(columns={"imię": "Imię", "wiek": "Wiek"})

cechy   Imię  Wiek    kraj  ocena kontynent
numer
1001    Mark    55  Włochy    4.5    Europa
1000    John    33     USA    6.7   Ameryka
1002     Tim    41     USA    3.9   Ameryka
1003   Jenny    12  Niemcy    9.0    Europa

In [391]:
df.drop(columns=["imię", "kraj"],
        index=[1000, 1003])
df

cechy   imię  wiek    kraj  ocena kontynent
numer
1001    Mark    55  Włochy    4.5    Europa
1000    John    33     USA    6.7   Ameryka
1002     Tim    41     USA    3.9   Ameryka
1003   Jenny    12  Niemcy    9.0    Europa

In [392]:
# create a sample dataframe
data = {"name": ["Alice", "Bob", "Charlie"],
        "age": [25, 30, 35],
        "gender": ["F", "M", "M"]}

df1 = pd.DataFrame(data)

print(df)

cechy   imię  wiek    kraj  ocena kontynent
numer
1001    Mark    55  Włochy    4.5    Europa
1000    John    33     USA    6.7   Ameryka
1002     Tim    41     USA    3.9   Ameryka
1003   Jenny    12  Niemcy    9.0    Europa

In [393]:
# drop the "gender" column
df1 = df1.drop("gender", axis=1)

print(df1)

      name  age
0    Alice   25
1      Bob   30
2  Charlie   35

In [394]:
# drop the "gender" column
df1 = df1.drop(columns="age",
             index=1)

print(df1)

      name
0    Alice
2  Charlie

In [395]:
df.T  # Skrót od df.transpose()

numer        1001     1000     1002    1003
cechy
imię         Mark     John      Tim   Jenny
wiek           55       33       41      12
kraj       Włochy      USA      USA  Niemcy
ocena         4.5      6.7      3.9       9
kontynent  Europa  Ameryka  Ameryka  Europa

In [396]:
df.loc[:, ["kontynent", "kraj", "imię", "wiek", "ocena"]]

cechy kontynent    kraj   imię  wiek  ocena
numer
1001     Europa  Włochy   Mark    55    4.5
1000    Ameryka     USA   John    33    6.7
1002    Ameryka     USA    Tim    41    3.9
1003     Europa  Niemcy  Jenny    12    9.0

# Operowanie danymi
## Wybieranie danych

In [397]:
df

cechy   imię  wiek    kraj  ocena kontynent
numer
1001    Mark    55  Włochy    4.5    Europa
1000    John    33     USA    6.7   Ameryka
1002     Tim    41     USA    3.9   Ameryka
1003   Jenny    12  Niemcy    9.0    Europa

In [398]:
# Użycie skalarów do wyboru zarówno wierszy, jak i kolumn, zwraca skalar
df.loc[1001, "imię"]

'Mark'

In [399]:
df.iloc[0,0]

'Mark'

In [400]:
df.loc[:,"imię":"wiek"]

cechy   imię  wiek
numer
1001    Mark    55
1000    John    33
1002     Tim    41
1003   Jenny    12

In [401]:
# Użycie skalara do wyboru wiersza lub kolumny zwraca obiekt Series
df.loc[[1001, 1002], "wiek"]

numer
1001    55
1002    41
Name: wiek, dtype: int64

In [402]:
df.loc[[1001, 1002], ["wiek"]]

cechy  wiek
numer
1001     55
1002     41

In [403]:
# Wybranie wielu wierszy i kolumn zwraca obiekt DataFrame
df.loc[:1002, ["imię", "kraj"]]

cechy  imię    kraj
numer
1001   Mark  Włochy
1000   John     USA
1002    Tim     USA

In [404]:
df.iloc[0, 0]  # Zwraca skalar

'Mark'

In [405]:
df.iloc[[0, 2], 1]  # Zwraca Series

numer
1001    55
1002    41
Name: wiek, dtype: int64

In [406]:
df.iloc[:3, [0, 2]]  # Zwraca DataFrame

cechy  imię    kraj
numer
1001   Mark  Włochy
1000   John     USA
1002    Tim     USA

In [407]:
df.iloc[:3,0:2]

cechy  imię  wiek
numer
1001   Mark    55
1000   John    33
1002    Tim    41

In [408]:
df

cechy   imię  wiek    kraj  ocena kontynent
numer
1001    Mark    55  Włochy    4.5    Europa
1000    John    33     USA    6.7   Ameryka
1002     Tim    41     USA    3.9   Ameryka
1003   Jenny    12  Niemcy    9.0    Europa

In [409]:
tf = (df["wiek"] > 40) & (df["kraj"] == "USA")
tf  # To jest obiekt Series zawierający wyłącznie wartości True lub False

numer
1001    False
1000    False
1002     True
1003    False
dtype: bool

In [410]:
df.loc[tf, :]

cechy imię  wiek kraj  ocena kontynent
numer
1002   Tim    41  USA    3.9   Ameryka

In [411]:
df[tf]

cechy imię  wiek kraj  ocena kontynent
numer
1002   Tim    41  USA    3.9   Ameryka

In [412]:
df.loc[df.index > 1001, :]

cechy   imię  wiek    kraj  ocena kontynent
numer
1002     Tim    41     USA    3.9   Ameryka
1003   Jenny    12  Niemcy    9.0    Europa

In [413]:
df.loc[df["kraj"].isin(["Włochy", "Niemcy"]), :]

cechy   imię  wiek    kraj  ocena kontynent
numer
1001    Mark    55  Włochy    4.5    Europa
1003   Jenny    12  Niemcy    9.0    Europa

In [414]:
df[df["kraj"].isin(["Włochy", "Niemcy"])]

cechy   imię  wiek    kraj  ocena kontynent
numer
1001    Mark    55  Włochy    4.5    Europa
1003   Jenny    12  Niemcy    9.0    Europa

In [415]:
# Może to być roczna suma opadów w milimetrach
rainfall = pd.DataFrame(data={"Miasto 1": [300.1, 100.2],
                              "Miasto 2": [400.3, 300.4],
                              "Miasto 3": [1000.5, 1100.6]})
rainfall

   Miasto 1  Miasto 2  Miasto 3
0     300.1     400.3    1000.5
1     100.2     300.4    1100.6

In [416]:
rainfall < 400

   Miasto 1  Miasto 2  Miasto 3
0      True     False     False
1      True      True     False

In [417]:
rainfall[rainfall < 400]

   Miasto 1  Miasto 2  Miasto 3
0     300.1       NaN       NaN
1     100.2     300.4       NaN

In [418]:
# MultiIndex trzeba posortować
df_multi = df.reset_index().set_index(["kontynent", "kraj"])
df_multi = df_multi.sort_index()
df_multi

cechy             numer   imię  wiek  ocena
kontynent kraj
Ameryka   USA      1000   John    33    6.7
          USA      1002    Tim    41    3.9
Europa    Niemcy   1003  Jenny    12    9.0
          Włochy   1001   Mark    55    4.5

In [419]:
df_multi.loc["Europa", :]

cechy   numer   imię  wiek  ocena
kraj
Niemcy   1003  Jenny    12    9.0
Włochy   1001   Mark    55    4.5

In [420]:
df_multi.loc[("Europa", "Włochy"), :]

cechy             numer  imię  wiek  ocena
kontynent kraj
Europa    Włochy   1001  Mark    55    4.5

In [421]:
df_multi.reset_index(level=0)

cechy  kontynent  numer   imię  wiek  ocena
kraj
USA      Ameryka   1000   John    33    6.7
USA      Ameryka   1002    Tim    41    3.9
Niemcy    Europa   1003  Jenny    12    9.0
Włochy    Europa   1001   Mark    55    4.5

## Ustawianie danych

In [422]:
# Najpierw skopiuj DataFrame, aby oryginał pozostał nietknięty
df2 = df.copy()

In [423]:
df2.loc[1000, "imię"] = "JOHN"
df2

cechy   imię  wiek    kraj  ocena kontynent
numer
1001    Mark    55  Włochy    4.5    Europa
1000    JOHN    33     USA    6.7   Ameryka
1002     Tim    41     USA    3.9   Ameryka
1003   Jenny    12  Niemcy    9.0    Europa

In [424]:
df2.loc[[1000, 1001], "ocena"] = [3, 4]
df2

cechy   imię  wiek    kraj  ocena kontynent
numer
1001    Mark    55  Włochy    4.0    Europa
1000    JOHN    33     USA    3.0   Ameryka
1002     Tim    41     USA    3.9   Ameryka
1003   Jenny    12  Niemcy    9.0    Europa

In [425]:
tf = (df2["wiek"] < 20) | (df2["kraj"] == "USA")
df2.loc[tf, "imię"] = "xxx"
df2

cechy  imię  wiek    kraj  ocena kontynent
numer
1001   Mark    55  Włochy    4.0    Europa
1000    xxx    33     USA    3.0   Ameryka
1002    xxx    41     USA    3.9   Ameryka
1003    xxx    12  Niemcy    9.0    Europa

In [426]:
# Najpierw skopiuj DataFrame, aby oryginał pozostał nietknięty
rainfall2 = rainfall.copy()
rainfall2

   Miasto 1  Miasto 2  Miasto 3
0     300.1     400.3    1000.5
1     100.2     300.4    1100.6

In [427]:
# Ustaw 0 wszędzie tam, gdzie wartości są poniżej 400
rainfall2[rainfall2 < 400] = 0
rainfall2

   Miasto 1  Miasto 2  Miasto 3
0       0.0     400.3    1000.5
1       0.0       0.0    1100.6

In [428]:
df2

cechy  imię  wiek    kraj  ocena kontynent
numer
1001   Mark    55  Włochy    4.0    Europa
1000    xxx    33     USA    3.0   Ameryka
1002    xxx    41     USA    3.9   Ameryka
1003    xxx    12  Niemcy    9.0    Europa

In [429]:
df2.replace("USA", "Stany Zjednoczone")

cechy  imię  wiek               kraj  ocena kontynent
numer
1001   Mark    55             Włochy    4.0    Europa
1000    xxx    33  Stany Zjednoczone    3.0   Ameryka
1002    xxx    41  Stany Zjednoczone    3.9   Ameryka
1003    xxx    12             Niemcy    9.0    Europa

In [430]:
df2.replace({"kraj": {"USA": "Stany Zjednoczone"}})

cechy  imię  wiek               kraj  ocena kontynent
numer
1001   Mark    55             Włochy    4.0    Europa
1000    xxx    33  Stany Zjednoczone    3.0   Ameryka
1002    xxx    41  Stany Zjednoczone    3.9   Ameryka
1003    xxx    12             Niemcy    9.0    Europa

In [431]:
df2

cechy  imię  wiek    kraj  ocena kontynent
numer
1001   Mark    55  Włochy    4.0    Europa
1000    xxx    33     USA    3.0   Ameryka
1002    xxx    41     USA    3.9   Ameryka
1003    xxx    12  Niemcy    9.0    Europa

In [432]:
df2.loc[:, "rabat"] = 0
df2.loc[:, "cena"] = [49.9, 49.9, 99.9, 99.9]
df2

cechy  imię  wiek    kraj  ocena kontynent  rabat  cena
numer
1001   Mark    55  Włochy    4.0    Europa      0  49.9
1000    xxx    33     USA    3.0   Ameryka      0  49.9
1002    xxx    41     USA    3.9   Ameryka      0  99.9
1003    xxx    12  Niemcy    9.0    Europa      0  99.9

In [433]:
df2 = df.copy()  # zacznijmy od nowej kopii
df2.loc[:, "rok urodzenia"] = 2021 - df2["wiek"]
df2

cechy   imię  wiek    kraj  ocena kontynent  rok urodzenia
numer
1001    Mark    55  Włochy    4.5    Europa           1966
1000    John    33     USA    6.7   Ameryka           1988
1002     Tim    41     USA    3.9   Ameryka           1980
1003   Jenny    12  Niemcy    9.0    Europa           2009

## Brakujące dane

In [434]:
df2

cechy   imię  wiek    kraj  ocena kontynent  rok urodzenia
numer
1001    Mark    55  Włochy    4.5    Europa           1966
1000    John    33     USA    6.7   Ameryka           1988
1002     Tim    41     USA    3.9   Ameryka           1980
1003   Jenny    12  Niemcy    9.0    Europa           2009

In [435]:
df2 = df.copy() # zacznijmy od nowej kopii
df2.loc[1000, "ocena"] = None
df2.loc[1003, :] = None
df2

cechy  imię  wiek    kraj  ocena kontynent
numer
1001   Mark  55.0  Włochy    4.5    Europa
1000   John  33.0     USA    NaN   Ameryka
1002    Tim  41.0     USA    3.9   Ameryka
1003   None   NaN    None    NaN      None

In [436]:
df2.dropna()

cechy  imię  wiek    kraj  ocena kontynent
numer
1001   Mark  55.0  Włochy    4.5    Europa
1002    Tim  41.0     USA    3.9   Ameryka

In [437]:
df2.dropna(how="all")

cechy  imię  wiek    kraj  ocena kontynent
numer
1001   Mark  55.0  Włochy    4.5    Europa
1000   John  33.0     USA    NaN   Ameryka
1002    Tim  41.0     USA    3.9   Ameryka

In [438]:
df2.isna()

cechy   imię   wiek   kraj  ocena  kontynent
numer
1001   False  False  False  False      False
1000   False  False  False   True      False
1002   False  False  False  False      False
1003    True   True   True   True       True

In [439]:
df2.fillna({"ocena": df2["ocena"].mean()})

cechy  imię  wiek    kraj  ocena kontynent
numer
1001   Mark  55.0  Włochy    4.5    Europa
1000   John  33.0     USA    4.2   Ameryka
1002    Tim  41.0     USA    3.9   Ameryka
1003   None   NaN    None    4.2      None

## Zduplikowane dane

In [440]:
df.drop_duplicates(["kraj", "kontynent"])

cechy   imię  wiek    kraj  ocena kontynent
numer
1001    Mark    55  Włochy    4.5    Europa
1000    John    33     USA    6.7   Ameryka
1003   Jenny    12  Niemcy    9.0    Europa

In [441]:
df.index.is_unique

True

In [442]:
df["kraj"].is_unique

False

In [443]:
df["kraj"].unique()

array(['Włochy', 'USA', 'Niemcy'], dtype=object)

In [444]:
df

cechy   imię  wiek    kraj  ocena kontynent
numer
1001    Mark    55  Włochy    4.5    Europa
1000    John    33     USA    6.7   Ameryka
1002     Tim    41     USA    3.9   Ameryka
1003   Jenny    12  Niemcy    9.0    Europa

In [445]:
df.duplicated()

numer
1001    False
1000    False
1002    False
1003    False
dtype: bool

In [446]:
df.loc[df["kraj"].duplicated(keep=False), :]

cechy  imię  wiek kraj  ocena kontynent
numer
1000   John    33  USA    6.7   Ameryka
1002    Tim    41  USA    3.9   Ameryka

In [447]:
# Domyślnie jako True oznaczane są tylko duplikaty,
# (bez pierwszego wystąpienia)
df["kraj"].duplicated()

numer
1001    False
1000    False
1002     True
1003    False
Name: kraj, dtype: bool

In [448]:
# Aby uzyskać wszystkie wiersze, w których "kraj" jest zduplikowany,
# użyj keep=False
df.loc[df["kraj"].duplicated(keep=False), :]

cechy  imię  wiek kraj  ocena kontynent
numer
1000   John    33  USA    6.7   Ameryka
1002    Tim    41  USA    3.9   Ameryka

## Operacje arytmetyczne

In [449]:
rainfall

   Miasto 1  Miasto 2  Miasto 3
0     300.1     400.3    1000.5
1     100.2     300.4    1100.6

In [450]:
rainfall + 100

   Miasto 1  Miasto 2  Miasto 3
0     400.1     500.3    1100.5
1     200.2     400.4    1200.6

In [451]:
more_rainfall = pd.DataFrame(data=[[100, 200], [300, 400]],
                             index=[1, 2],
                             columns=["Miasto 1", "Miasto 4"])
more_rainfall

   Miasto 1  Miasto 4
1       100       200
2       300       400

In [452]:
rainfall + more_rainfall

   Miasto 1  Miasto 2  Miasto 3  Miasto 4
0       NaN       NaN       NaN       NaN
1     200.2       NaN       NaN       NaN
2       NaN       NaN       NaN       NaN

In [453]:
rainfall.add(more_rainfall, fill_value=0)

   Miasto 1  Miasto 2  Miasto 3  Miasto 4
0     300.1     400.3    1000.5       NaN
1     200.2     300.4    1100.6     200.0
2     300.0       NaN       NaN     400.0

In [454]:
rainfall

   Miasto 1  Miasto 2  Miasto 3
0     300.1     400.3    1000.5
1     100.2     300.4    1100.6

In [455]:
# Obiekt Series pobrany z wiersza
rainfall.loc[1, :]

Miasto 1     100.2
Miasto 2     300.4
Miasto 3    1100.6
Name: 1, dtype: float64

In [456]:
rainfall + rainfall.loc[1, :]

   Miasto 1  Miasto 2  Miasto 3
0     400.3     700.7    2101.1
1     200.4     600.8    2201.2

In [457]:
# Obiekt Series pobrany z kolumny
rainfall.loc[:, "Miasto 2"]

0    400.3
1    300.4
Name: Miasto 2, dtype: float64

In [458]:
rainfall

   Miasto 1  Miasto 2  Miasto 3
0     300.1     400.3    1000.5
1     100.2     300.4    1100.6

In [459]:
rainfall.loc[:, "Miasto 2"]

0    400.3
1    300.4
Name: Miasto 2, dtype: float64

In [460]:
rainfall.add(rainfall.loc[:, "Miasto 2"], axis=0)

   Miasto 1  Miasto 2  Miasto 3
0     700.4     800.6    1400.8
1     400.6     600.8    1401.0

In [461]:
# Utwórzmy nowy obiekt DataFrame
users = pd.DataFrame(data=[" mArk ", "JOHN  ", "Tim", " jenny"],
                     columns=["imię"])
users

     imię
0   mArk
1  JOHN
2     Tim
3   jenny

In [462]:
users_cleaned = users.loc[:, "imię"].str.strip().str.capitalize()
users_cleaned

0     Mark
1     John
2      Tim
3    Jenny
Name: imię, dtype: object

In [463]:
users_cleaned.str.startswith("J")

0    False
1     True
2    False
3     True
Name: imię, dtype: bool

## Stosowanie funkcji

In [464]:
rainfall

   Miasto 1  Miasto 2  Miasto 3
0     300.1     400.3    1000.5
1     100.2     300.4    1100.6

In [465]:
def format_string(x):
    return f"{x:,.2f}"

In [466]:
# Zauważ, że przekazujemy funkcję bez jej wywołania,
# czyli format_string, a nie format_string()!
rainfall.applymap(format_string)

  Miasto 1 Miasto 2  Miasto 3
0   300.10   400.30  1,000.50
1   100.20   300.40  1,100.60

In [467]:
rainfall.applymap(lambda x: f"{x:,.2f}")

  Miasto 1 Miasto 2  Miasto 3
0   300.10   400.30  1,000.50
1   100.20   300.40  1,100.60

# Łączenie obiektów DataFrame
## Konkatenacja

In [468]:
df

cechy   imię  wiek    kraj  ocena kontynent
numer
1001    Mark    55  Włochy    4.5    Europa
1000    John    33     USA    6.7   Ameryka
1002     Tim    41     USA    3.9   Ameryka
1003   Jenny    12  Niemcy    9.0    Europa

In [469]:
data=[[15, "Francja", 4.1, "Becky"],
      [44, "Kanada", 6.1, "Leanne"]]
more_users = pd.DataFrame(data=data,
                          columns=["wiek", "kraj", "ocena", "imię"],
                          index=[1000, 1011])
more_users

      wiek     kraj  ocena    imię
1000    15  Francja    4.1   Becky
1011    44   Kanada    6.1  Leanne

In [470]:
pd.concat([df, more_users], axis=0)

        imię  wiek     kraj  ocena kontynent
1001    Mark    55   Włochy    4.5    Europa
1000    John    33      USA    6.7   Ameryka
1002     Tim    41      USA    3.9   Ameryka
1003   Jenny    12   Niemcy    9.0    Europa
1000   Becky    15  Francja    4.1       NaN
1011  Leanne    44   Kanada    6.1       NaN

**Dygresja**

Powyżej pojawił się zduplikowany indeks. Chcę to naprawić.

In [471]:
# Tworzę kopię df i spróbuję naprawić indeks tak, aby zawierał tylko unikalne wartości.
df_test = pd.concat([df, more_users], axis=0)
df_test

        imię  wiek     kraj  ocena kontynent
1001    Mark    55   Włochy    4.5    Europa
1000    John    33      USA    6.7   Ameryka
1002     Tim    41      USA    3.9   Ameryka
1003   Jenny    12   Niemcy    9.0    Europa
1000   Becky    15  Francja    4.1       NaN
1011  Leanne    44   Kanada    6.1       NaN

In [472]:
# Muszę stworzyć tyle indeksów, ile jest wierszy.
df_test.shape[0]

6

In [473]:
# Nowy index stworzony zwykłą pętlą
new_index = []
for i in range(df_test.shape[0]):
    new_index.append(1000 + i)

new_index

[1000, 1001, 1002, 1003, 1004, 1005]

In [474]:
# Nowy index stworzony przez list comprehension
new_index_2 = [1000 + i for i in range(df_test.shape[0])]
new_index_2

[1000, 1001, 1002, 1003, 1004, 1005]

In [475]:
# Dodam nowy index najpierw jako zwykłą kolumnę
df_test['to_be_index'] = new_index_2
df_test

        imię  wiek     kraj  ocena kontynent  to_be_index
1001    Mark    55   Włochy    4.5    Europa         1000
1000    John    33      USA    6.7   Ameryka         1001
1002     Tim    41      USA    3.9   Ameryka         1002
1003   Jenny    12   Niemcy    9.0    Europa         1003
1000   Becky    15  Francja    4.1       NaN         1004
1011  Leanne    44   Kanada    6.1       NaN         1005

In [476]:
#Teraz ustawię tę kolumnę jako index
df_test.set_index('to_be_index', inplace=True)
df_test

               imię  wiek     kraj  ocena kontynent
to_be_index
1000           Mark    55   Włochy    4.5    Europa
1001           John    33      USA    6.7   Ameryka
1002            Tim    41      USA    3.9   Ameryka
1003          Jenny    12   Niemcy    9.0    Europa
1004          Becky    15  Francja    4.1       NaN
1005         Leanne    44   Kanada    6.1       NaN

In [477]:
# Jeszcze usunę nazwę kolumny z indeksem
df_test.index.name = ''
df_test

        imię  wiek     kraj  ocena kontynent

1000    Mark    55   Włochy    4.5    Europa
1001    John    33      USA    6.7   Ameryka
1002     Tim    41      USA    3.9   Ameryka
1003   Jenny    12   Niemcy    9.0    Europa
1004   Becky    15  Francja    4.1       NaN
1005  Leanne    44   Kanada    6.1       NaN

A teraz zróbmy to samo, ale nie jak junior

In [482]:
# Resetuję index i tak naprawdę, to już mam unikalne indeksy
df_test = df_test.reset_index(drop=True)
df_test

     imię  wiek     kraj  ocena kontynent
0    Mark    55   Włochy    4.5    Europa
1    John    33      USA    6.7   Ameryka
2     Tim    41      USA    3.9   Ameryka
3   Jenny    12   Niemcy    9.0    Europa
4   Becky    15  Francja    4.1       NaN
5  Leanne    44   Kanada    6.1       NaN

In [483]:
# Ale chcę, żeby indeksy miały formę 1000, 1001 itd.
df_test.set_index(pd.Index(range(1000, 1000+len(df_test))), inplace=True)
df_test

        imię  wiek     kraj  ocena kontynent
1000    Mark    55   Włochy    4.5    Europa
1001    John    33      USA    6.7   Ameryka
1002     Tim    41      USA    3.9   Ameryka
1003   Jenny    12   Niemcy    9.0    Europa
1004   Becky    15  Francja    4.1       NaN
1005  Leanne    44   Kanada    6.1       NaN

Wracając do kursu...

In [260]:
data=[[3, 4],
      [5, 6]]
more_categories = pd.DataFrame(data=data,
                               columns=["testy", "logowania"],
                               index=[1000, 2000])
more_categories

      testy  logowania
1000      3          4
2000      5          6

In [100]:
concat_dfs = pd.concat([df, more_categories], axis=1)
concat_dfs

       imię  wiek    kraj  ocena kontynent  testy  logowania
1000   John  33.0     USA    6.7   Ameryka    3.0        4.0
1001   Mark  55.0  Włochy    4.5    Europa    NaN        NaN
1002    Tim  41.0     USA    3.9   Ameryka    NaN        NaN
1003  Jenny  12.0  Niemcy    9.0    Europa    NaN        NaN
2000    NaN   NaN     NaN    NaN       NaN    5.0        6.0

## Operacje join i merge

In [487]:
df1 = pd.DataFrame(data=[[1, 2], [3, 4], [5, 6]],
                   columns=["A", "B"])
df1

   A  B
0  1  2
1  3  4
2  5  6

In [488]:
df2 = pd.DataFrame(data=[[10, 20], [30, 40]],
                   columns=["C", "D"], index=[1, 3])
df2

    C   D
1  10  20
3  30  40

In [489]:
df1.join(df2, how="inner")

   A  B   C   D
1  3  4  10  20

In [490]:
df1.join(df2, how="left")

   A  B     C     D
0  1  2   NaN   NaN
1  3  4  10.0  20.0
2  5  6   NaN   NaN

In [491]:
df1.join(df2, how="right")

     A    B   C   D
1  3.0  4.0  10  20
3  NaN  NaN  30  40

In [492]:
df1.join(df2, how="outer")

     A    B     C     D
0  1.0  2.0   NaN   NaN
1  3.0  4.0  10.0  20.0
2  5.0  6.0   NaN   NaN
3  NaN  NaN  30.0  40.0

In [493]:
# Dodaj kolumnę o nazwie "kategoria" do obu obiektów DataFrame
df1["kategoria"] = ["a", "b", "c"]
df2["kategoria"] = ["c", "b"]

In [494]:
df1

   A  B kategoria
0  1  2         a
1  3  4         b
2  5  6         c

In [495]:
df2

    C   D kategoria
1  10  20         c
3  30  40         b

In [496]:
df1.merge(df2, how="inner", on=["kategoria"])

   A  B kategoria   C   D
0  3  4         b  30  40
1  5  6         c  10  20

In [497]:
df1.merge(df2, how="left", on=["kategoria"])

   A  B kategoria     C     D
0  1  2         a   NaN   NaN
1  3  4         b  30.0  40.0
2  5  6         c  10.0  20.0

# Statystyka opisowa i agregacja danych
## Statystyka opisowa

In [ ]:
rainfall

In [ ]:
rainfall.mean()

In [ ]:
rainfall.mean(axis=1)

## Grupowanie

In [ ]:
df.groupby(["kontynent"]).mean()

In [ ]:
df.groupby(["kontynent", "kraj"]).mean()

In [ ]:
df.groupby(["kontynent"]).agg(lambda x: x.max() - x.min())

## Funkcje pivot_table i melt

In [ ]:
data = [["Pomarańcze", "Północ", 12.30],
        ["Jabłka", "Południe", 10.55],
        ["Pomarańcze", "Południe", 22.00],
        ["Banany", "Południe", 5.90],
        ["Banany", "Północ", 31.30],
        ["Pomarańcze", "Północ", 13.10]]

sales = pd.DataFrame(data=data,
                     columns=["Owoce", "Region", "Przychód"])
sales

In [ ]:
pivot = pd.pivot_table(sales,
                       index="Owoce", columns="Region",
                       values="Przychód", aggfunc="sum",
                       margins=True, margins_name="Ogółem")
pivot

In [ ]:
pd.melt(pivot.iloc[:-1,:-1].reset_index(),
        id_vars="Owoce",
        value_vars=["Północ", "Południe"], value_name="Przychód")

# Tworzenie wykresów
## Matplotlib

In [ ]:
import numpy as np
%matplotlib inline
# lub %matplotlib notebook

In [ ]:
data = pd.DataFrame(data=np.random.rand(4, 4) * 100000,
                    index=["I kw.", "II kw.", "III kw.", "IV kw."],
                    columns=["Wschód", "Zachód", "Północ", "Południe"])
data.index.name = "Kwartały"
data.columns.name = "Region"
data

In [ ]:
data.plot()  # Skrót od data.plot.line()

## Plotly

In [ ]:
# Ustaw silnik tworzenia wykresów na Plotly
pd.options.plotting.backend = "plotly"

In [ ]:
data.plot()

In [ ]:
# Wyświetl te same dane jako wykres słupkowy
data.plot.bar(barmode="group")

# Import i eksport danych
## Eksport pliku CSV

In [ ]:
df.to_csv("course_participants.csv")

## Import pliku CSV

In [ ]:
msft = pd.read_csv("csv/MSFT.csv")

In [ ]:
msft.info()

In [ ]:
# Z powodu braku miejsca wybieram tylko kilka kolumn
# Możesz też po prostu uruchomić: msft.head()
msft.loc[:, ["Date", "Adj Close", "Volume"]].head()

In [ ]:
msft.loc[:, ["Date", "Adj Close", "Volume"]].tail(2)

In [ ]:
msft.loc[:, ["Adj Close", "Volume"]].describe()

In [ ]:
# Adres URL został podzielony na wiersze, aby zmieścił się na stronie.
url = ("https://raw.githubusercontent.com/fzumstein/"
       "python-for-excel/1st-edition/csv/MSFT.csv")
msft = pd.read_csv(url)

In [ ]:
msft.loc[:, ["Date", "Adj Close", "Volume"]].head(2)